;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! auto-dark)
(package! typst-ts-mode
  :recipe (:host codeberg :repo "meow_king/typst-ts-mode"))
(package! mood-line)
(package! spacious-padding)
(package! elixir-ts-mode)
(package! ef-themes)
(package! treesit-auto)
(package! just-mode)
